{"adjusting": ["Picking up the object: The person reaches out with their hand and grasps the object.", "Holding the object: The person maintains a firm grip on the object with their hand.", "Adjusting the object: The person manipulates the object in some way, such as twisting, turning, or bending it.", "Releasing the object: The person lets go of the object and it falls back to the ground or the person's hand.", "Putting the object down: The person places the object back on a surface or in its original location."], "assembling": ["Opening the package: The person removes the object from its packaging, which may involve tearing, cutting, or removing a protective cover.", "Examining the parts: The person inspects the object and its parts to ensure they are complete and in good condition.", "Assembling the object: The person puts the parts together according to the instructions, which may involve fastening, connecting, or aligning different components.", "Testing the object: The person checks the object to ensure it functions properly and all the parts are securely in place.", "Storing the object: The person places the assembled object in a suitable location, such as a shelf, drawer, or storage container, where it will be easily accessible and protected from damage."], "blocking": ["Hand positioning: The person's hands may be placed in front of their body, with fingers or palms facing the object they are blocking.", "Body posture: The person may be standing with their feet shoulder-width apart, knees slightly bent, and weight distributed evenly on both feet.", "Eye contact: The person may be looking directly at the object they are blocking, maintaining eye contact with it.", "Focus: The person's attention is likely directed towards the object they are blocking, indicating their concentration on the task.", "Physical barrier: The person's body may be positioned in such a way that it forms a physical barrier between themselves and the object, preventing it from passing through."], "blowing": ["The person's mouth is open and their lips are puckered, indicating that they are blowing.", "The person's cheeks are puffed out, which is a common action when blowing.", "The person's eyes are closed, which is often done when focusing on the task of blowing.", "The person's head is tilted back, which can help with the force and direction of the breath.", "The person's arms are outstretched, which can provide additional support and stability while blowing."], "boarding": ["The person reaches out and grabs the edge of the object.", "The person lifts their foot and places it on the object.", "The person shifts their weight and begins to pull the object towards them.", "The person uses their arms to help with the pulling motion.", "The person continues to pull the object until it is fully on board."], "breaking": ["The person's hand or arm making contact with the object.", "The object being struck or grabbed by the person.", "The object breaking or shattering as a result of the impact.", "The person's reaction to the broken object, such as surprise or anger.", "The scattered pieces of the broken object on the ground or surrounding area."], "brushing with": ["The person's hand reaching out towards the object.", "The person's hand gripping the object.", "The person's hand pulling the object towards them.", "The person's hand holding the object.", "The person's hand releasing the object."], "buying": ["Hand holding the object: This action is often seen when a person is examining or testing an object to see if it meets their needs or expectations.", "Hand placing the object in a bag or container: This action indicates that the person has decided to purchase the object and is preparing to take it home or to another location.", "Hand counting out money or using a payment method: This action shows that the person is making a financial transaction to purchase the object.", "Hand holding a receipt or confirmation of purchase: This action shows that the person has completed the transaction and has received proof of their purchase.", "Hand carrying the object away from the seller: This action shows that the person has successfully completed the purchase and is taking possession of the object."], "carrying": ["Picking up the object: The person bends down or reaches out to grab the object with their hands.", "Holding the object: The person is in the process of holding the object in their hands, either by gripping it firmly or by supporting it with one hand while the other hand is free.", "Carrying the object: The person is actively moving the object, either by walking with it or by lifting it above their head.", "Placing the object down: The person is in the process of setting the object down on a surface, such as a table or the ground.", "Releasing the object: The person is letting go of the object, either by dropping it or by placing it back on a surface."], "catching": ["Reaching out: The person extends their arm and hand towards the object, preparing to grasp it.", "Focusing on the object: The person's eyes are directed towards the object, ensuring they are in the right position to catch it.", "Preparing to grasp: The person's hand forms a fist, with the fingers curled inwards, ready to wrap around the object.", "Catching the object: The person's hand makes contact with the object, either by using their fingertips or by enveloping it with their hand.", "Securing the object: The person's grip on the object is firm, ensuring that it doesn't slip out of their hand."], "chasing": ["Running: The person is moving quickly towards the object, using their legs to propel themselves forward.", "Jumping: The person is leaping into the air to reach the object, using their hands to grab or hold onto it.", "Diving: The person is diving or lunging towards the object, using their arms and legs to make a swift, coordinated movement.", "Catching: The person is using their hands to grasp the object, either by reaching out and grabbing it or by using a specific technique like a one-handed or two-handed catch.", "Throwing: The person is using their arm and hand to throw the object, either by releasing it with force or by using a specific throwing technique like a backhand or forehand throw."], "checking": ["Hand grasping the object", "Fingers gripping the object", "Eye focusing on the object", "Brain processing the visual information", "Decision making and action planning based on the visual information"], "cleaning": ["Picking up the object: The person reaches out and grasps the object they want to clean.", "Holding the object: The person holds the object securely in one or both hands, ensuring it doesn't slip or fall.", "Preparing the cleaning solution: The person may pour or apply the cleaning solution to a cloth, sponge, or other cleaning tool.", "Cleaning the object: The person uses the cleaning tool to scrub, wipe, or sponge the object, removing dirt, grime, or stains.", "Rinsing or wiping off the excess solution: The person may use water or a cleaning solution to rinse or wipe off any excess solution from the object, leaving it clean and dry."], "controlling": ["Hand grasping the object: The person's hand is visibly holding onto the object, indicating that they are in control of it.", "Finger movements: The person's fingers are moving in a specific pattern, which is often associated with operating a control or a button on the object.", "Eye contact: The person is looking at the object, which suggests that they are focused on controlling it.", "Body posture: The person's body posture, such as sitting or standing, can indicate that they are in a position to control the object.", "Facial expressions: The person's facial expressions, such as concentration or determination, can also suggest that they are actively controlling the object."], "cooking": ["Preparing ingredients: The person may be seen chopping, slicing, or measuring ingredients on a cutting board or countertop.", "Cooking the object: The person may be using various cooking techniques such as sautéing, boiling, baking, or frying the object.", "Stirring or mixing: The person may be using a spoon or whisk to stir or mix ingredients together in a pot or pan.", "Using utensils: The person may be using utensils such as a spatula, tongs, or a ladle to handle the object while cooking.", "Monitoring progress: The person may be checking on the object periodically to ensure that it is cooked to the desired level and to make any necessary adjustments to the cooking process."], "cutting": ["Gripping the object: The person holds the object firmly with their hands, providing stability and control during the cutting process.", "Positioning the object: The person places the object on a stable surface, such as a cutting board or a countertop, to ensure safety and prevent slipping during the cut.", "Preparing the cutting tool: The person selects an appropriate cutting tool, such as a knife or a pair of scissors, and holds it in a safe and secure manner.", "Cutting the object: The person applies pressure and makes a controlled motion with the cutting tool to cut through the object.", "Removing the cut object: The person carefully removes the cut object from the surface, using a suitable tool or technique to prevent injury or damage to the surrounding area."], "cutting with": ["Holding the object: The person is holding the object, such as a knife or scissors, in their hands.", "Preparing to cut: The person is getting ready to make a cut, with the object positioned correctly.", "Cutting motion: The person is actively cutting the object, using a sawing or slicing motion.", "Finished cut: The person has completed the cut, and the object is now separated into two parts.", "Disposing of the object: The person is disposing of the used object, such as a knife blade or scissors, in a safe manner."], "directing": ["Hand gesture: The person may use hand gestures to indicate the direction they want the object to move in.", "Eye contact: The person may make eye contact with the object to focus their attention and direct it.", "Body language: The person may use their body language, such as leaning forward or bending their knees, to indicate their intention to direct the object.", "Verbal cues: The person may use verbal cues, such as saying \"go\" or \"come,\" to communicate their direction to the object.", "Visual cues: The person may use visual cues, such as pointing or using a tool like a remote control, to direct the object."], "dragging": ["The person's hand gripping the object.", "The object being pulled by the person.", "The person's body positioning and movement as they drag the object.", "The path that the object and person are moving along.", "The environment around the person and object, such as obstacles or other people, that may be affected by the dragging action."], "dribbling": ["Hand positioning: The person holding the object with their hand(s) in a way that allows for smooth and controlled dribbling.", "Ball control: The person using their fingers or hand to manipulate the object, such as spinning it on their fingers or bouncing it on their hand.", "Body movement: The person's body may be in motion as they dribble, with their feet shifting their weight and their upper body rotating to change direction.", "Eye contact: The person may be looking at the object or the ground to track its movement and maintain control.", "Environmental awareness: The person may be aware of their surroundings, such as other players or obstacles, and adjust their dribbling technique accordingly to avoid collisions or interruptions."], "drinking with": ["Holding the object (e.g. a cup or a bottle) in their hand.", "Bringing the object to their mouth.", "Lifting the object to their mouth.", "Raising the object to their mouth.", "Tipping the object to their mouth."], "driving": ["Steering wheel: The steering wheel is a key component of a vehicle's controls and is used by the driver to steer the vehicle.", "Pedals: The pedals, including the accelerator, brake, and clutch, are used by the driver to control the vehicle's speed and movement.", "Seat belt: The seat belt is a safety feature that is used by the driver to secure themselves in the vehicle while driving.", "Mirrors: The driver uses the side mirrors to check their surroundings and monitor the traffic behind them.", "Windshield wipers: The windshield wipers are used by the driver to clear rain, snow, or debris from the windshield, ensuring clear visibility while driving."], "drying": ["Holding the object: The person is holding the object to be dried, typically with one or both hands, to keep it stable and prevent it from falling or slipping.", "Positioning the object: The person is positioning the object in a way that allows for even and thorough drying. This may involve holding the object at a slight angle or tilt, or rotating it to ensure all surfaces are exposed to airflow.", "Using a towel or cloth: The person is using a towel or cloth to absorb any excess moisture from the object and to help facilitate the drying process. This may involve gently squeezing out any excess water or using the towel to wipe away any remaining moisture.", "Placing the object on a dry surface: The person is placing the object on a dry surface, such as a towel or a drying rack, to allow air to circulate around it and further aid in the drying process.", "Monitoring the drying process: The person is monitoring the drying process to ensure that the object is drying properly and not taking too long. This may involve periodically checking the object or rotating it to ensure even drying."], "eating": ["Picking up the object with their hands.", "Holding the object in their hands.", "Bringing the object to their mouth.", "Stuffing the object into their mouth.", "Chewing and swallowing the object."], "eating at": ["Picking up the object with their hands.", "Holding the object to their mouth.", "Bringing the object to their face.", "Placing the object on a surface.", "Removing the object from their mouth."], "exiting": ["The person's body language changes, such as their posture, facial expression, and body movements, indicating that they are leaving the object.", "The person's hand or arm moves towards the object, indicating that they are reaching for it or grabbing it.", "The person's feet move away from the object, indicating that they are stepping away from it.", "The person's gaze shifts away from the object, indicating that they are no longer focused on it.", "The person's voice changes, such as speaking louder or more quickly, indicating that they are making an effort to be heard or to convey urgency."], "feeding": ["Holding the object: The person is holding the object in their hand or hands.", "Preparing to feed: The person is getting ready to put the object into their mouth.", "Feeding: The person is actively putting the object into their mouth.", "Chewing: The person is chewing on the object.", "Swallowing: The person is swallowing the object."], "filling": ["Picking up the object: The person reaches out with their hand or arm and grasps the object.", "Holding the object: The person maintains their grip on the object, ensuring it doesn't slip or fall.", "Lifting the object: The person uses their strength to lift the object off the ground or surface it was on.", "Carrying the object: The person moves the object from one location to another, using their body to support the weight.", "Placing the object: The person carefully sets the object down in its intended location, ensuring it is stable and secure."], "flipping": ["Gripping the object: The person holds the object with their hands, typically using a firm grip to maintain control.", "Preparing to flip: The person positions themselves and the object, getting ready to initiate the flip.", "Flipping the object: The person uses their hands or other body movements to flip the object, causing it to spin or rotate.", "Catching the object: The person reaches out with their hands to catch the object as it completes its flip, aiming to grasp it securely.", "Releasing the object: The person releases the object from their grip, allowing it to continue spinning or moving in the desired direction."], "flushing": ["Hand grasping the object: The person holding the object in their hand.", "Hand moving towards the face: The person is bringing the object towards their face.", "Hand covering the nose: The person is covering their nose with their hand.", "Nose and mouth pressing together: The person is pressing their nose and mouth together.", "Hand releasing the object: The person is letting go of the object."], "flying": ["Hand holding the object: The person is holding the object in their hand, which is a crucial action for flying the object.", "Arm movement: The person is using their arm to control the object, guiding it through the air.", "Eye contact with the object: The person is keeping their eye on the object, ensuring that they are flying it accurately and maintaining control.", "Body positioning: The person is adjusting their body position to maintain balance and stability while flying the object.", "Focus on the target: The person is concentrating on the intended target, such as a landing spot or a specific point of interest, to ensure a successful flight."], "greeting": ["Hand reaching out: The person extends their hand towards the object, indicating their intention to interact with it.", "Eye contact: The person makes eye contact with the object, showing their focus and attention towards it.", "Body posture: The person stands or sits in a way that allows them to comfortably reach and interact with the object.", "Verbal greeting: The person may say a greeting or make a comment to the object, such as \"Hello\" or \"Nice to meet you.\"", "Handshake or other physical contact: In some cases, the person may shake the object or make other physical contact with it as a form of greeting or to establish a connection."], "grinding": ["Hand positioning: The person grinding the object will typically hold it with both hands, one on each side.", "Pressure application: The person will apply pressure to the object using their hands, either by pressing down or rubbing the object against a surface.", "Movement: The person will move the object back and forth or in a circular motion to grind it down.", "Focus: The person will concentrate on the task at hand, ensuring that they apply the right amount of pressure and movement to achieve the desired result.", "Safety precautions: Depending on the object being ground and the environment, the person may also take safety precautions such as wearing gloves or using a protective cover to prevent damage to their hands or the object being ground."], "grooming": ["Holding the object: The person is holding the object in their hand or using a tool to grip it.", "Inspecting the object: The person is closely examining the object to assess its condition or identify any issues.", "Cleaning the object: The person is using a cleaning solution or a brush to remove dirt, dust, or debris from the object.", "Polishing the object: The person is using a polishing cloth or a polishing compound to smooth out the surface of the object and remove any scratches or marks.", "Storing the object: The person is placing the object in a container or a protective case to keep it safe and organized."], "herding": ["Pointing: The person is pointing towards the object they want to herd.", "Walking: The person is walking towards the object, guiding it in the desired direction.", "Using a stick or a staff: The person is using a stick or a staff to help them herd the object, by pushing or prodding it in the right direction.", "Using a leash or a rope: The person is using a leash or a rope to tie the object down and keep it in place.", "Using verbal commands: The person is giving verbal commands to the object, such as \"sit,\" \"stay,\" or \"come,\" to guide it in the desired direction."], "hitting": ["The person's arm is raised and extended, with the hand gripping the object.", "The person's body is rotating and shifting their weight to generate force.", "The person's eyes are focused on the object, tracking its movement.", "The person's mouth is open, possibly making a sound to help with the swing.", "The person's hand is making contact with the object, transferring their force to it."], "holding": ["Grasping: The action of holding an object using one or more fingers or hand.", "Gripping: The action of firmly holding an object using one or more fingers or hand.", "Holding: The action of maintaining contact with an object using one or more fingers or hand.", "Supporting: The action of providing stability or balance to an object using one or more fingers or hand.", "Manipulating: The action of moving or handling an object using one or more fingers or hand."], "hopping on": ["The person's feet lifting off the ground.", "The person's body positioning themselves to jump.", "The person's arms reaching out for balance and support.", "The person's legs bending and straightening as they land on the object.", "The person's body maintaining balance and control throughout the jump."], "hosing": ["Holding the object: The person is gripping the object with their hands, either in a relaxed or firm manner, depending on the task at hand.", "Pointing to the object: The person is using the object to indicate or draw attention to something, such as a specific feature or location.", "Throwing the object: The person is releasing the object from their hands, either intentionally or accidentally, and it is in motion.", "Holding the object above their head: The person is lifting the object above their head, possibly to inspect it or to prepare for a specific action.", "Passing the object to someone else: The person is handing the object to another person, either as a gift, for assistance, or as part of a demonstration or instruction."], "hugging": ["The person's arms are wrapped around the object.", "The person's body is in close contact with the object.", "The person's head is positioned close to the object.", "The person's hands may be holding or gripping the object.", "The person's legs may be crossed or positioned in a way that supports their body as they hug the object."], "hunting": ["Focusing on the object: The hunter's eyes are locked onto the object they are hunting, allowing them to track its movement and determine their next course of action.", "Positioning: The hunter moves into a position that provides the best vantage point for observing the object, taking into account factors such as the object's size, distance, and surroundings.", "Stalking: The hunter moves slowly and quietly, using the cover of the environment to approach the object without alerting it.", "Aiming: The hunter aligns their weapon or other means of capture with the object, preparing to fire or release a trap.", "Capture or shot: The hunter successfully captures or shoots the object, completing the hunting process."], "inspecting": ["Holding the object in their hands: This action involves physically gripping the object and examining it closely.", "Using a magnifying glass or loupe: This action involves holding a magnifying glass or loupe over the object to examine it more closely and in greater detail.", "Taking photographs: This action involves using a camera or smartphone to capture images of the object from different angles and perspectives.", "Measuring the object: This action involves using tools such as a ruler or calipers to determine the size, length, or width of the object.", "Examining the object under a microscope: This action involves using a microscope to examine the object at a much smaller scale, allowing for a more detailed examination of its structure and features."], "installing": ["Picking up the object: The person reaches out and grabs the object with their hands.", "Holding the object: The person holds the object in their hands, ensuring it is secure and stable.", "Positioning the object: The person moves the object to the desired location, aligning it with the desired position.", "Securing the object: The person uses tools or methods to secure the object in place, preventing it from moving or falling.", "Inspecting the installation: The person checks the installation to ensure that it is properly secured and functioning as intended."], "jumping": ["The person's legs are bent and lifted off the ground.", "The person's arms are outstretched for balance and control.", "The person's body is facing the direction of the jump.", "The person's eyes are focused on the object they are jumping over.", "The person's mouth is open, possibly in a shout or a breath before the jump."], "kicking": ["The person's leg is raised and bent at the knee, with the foot pointing towards the object.", "The person's leg is extended forward, with the foot making contact with the object.", "The person's leg is swung forward and upward, with the foot making contact with the object.", "The person's leg is twisted and rotated, with the foot making contact with the object.", "The person's leg is kicked out, with the foot making contact with the object."], "kissing": ["The person's lips pressing against the object.", "The person's hands holding or gripping the object.", "The person's body positioning itself to make contact with the object.", "The person's eyes closing or focusing intently on the object.", "The person's breath being drawn in or released as they kiss the object."], "lassoing": ["The person's hand holding the lasso.", "The lasso itself, which is typically a rope or cord with a loop at one end.", "The motion of the person's arm and hand as they swing the lasso to encircle the object.", "The position of the object being lassoed, which may be stationary or moving.", "The person's body posture and balance as they maintain control of the lasso and the object."], "launching": ["Gripping the object: The person holds the object in their hands, ensuring a firm grip for launching.", "Preparing the launching area: The person checks the area for any obstacles or hazards that could interfere with the launch, and clears the area if necessary.", "Focusing on the target: The person concentrates on the intended target, ensuring that the object will land accurately.", "Pulling back the launching device: The person pulls back the launching device, which is typically a spring or compressed air, to build up the necessary force for launching the object.", "Releasing the launching device: The person releases the launching device, allowing the built-up force to propel the object forward."], "licking": ["The person's tongue extending out and making contact with the object.", "The person's head or upper body tilting towards the object.", "The person's hand or arm reaching out towards the object.", "The person's eyes focusing on the object.", "The person's mouth opening and closing as they lick the object."], "lying on": ["Lying down: The person is in a reclined position, with their body parallel to the surface they are lying on.", "Propping up on elbows: The person is lying down with their elbows raised, supporting their upper body.", "Sitting up: The person is in a semi-reclined position, with their upper body raised and supported by their arms.", "Lying on stomach: The person is lying face down, with their body in contact with the surface they are lying on.", "Lying on back: The person is lying face up, with their body in contact with the surface they are lying on."], "lifting": ["Bending the knees and lowering the center of gravity to create a stable base.", "Gripping the object with a firm yet relaxed grip, using the muscles of the arms, shoulders, and back.", "Inhaling and exhaling deeply to prepare the body for the lift and to maintain focus and control.", "Lifting the object using the muscles of the legs, core, and upper body in a smooth and controlled motion.", "Maintaining proper form and posture throughout the lift, with the object being lifted straight and close to the body."], "lighting": ["Hand holding a match or lighter.", "Focusing on the object to be lit.", "Slowly approaching the object.", "Striking the match or turning on the lighter.", "Extinguishing the flame or putting away the lighter after the object is lit."], "loading": ["Picking up the object: The person reaches out and grasps the object with their hands.", "Holding the object: The person supports the weight of the object with their hands, maintaining a firm grip.", "Lifting the object: The person uses their strength to lift the object off the ground or surface it was on.", "Carrying the object: The person moves the object while maintaining balance and control, using their arms and legs to support the weight.", "Placing the object: The person carefully sets the object down on a designated surface or location, ensuring it is stable and secure."], "losing": ["Searching frantically: The person may be seen looking around in a disorganized and panicked manner, trying to locate the lost object.", "Checking the usual spots: The person may be seen checking common places where they usually keep or store the object, such as pockets, bags, or drawers.", "Asking for help: The person may be seen seeking assistance from others, such as friends, family, or even strangers, in the hopes of finding the lost object.", "Retracing steps: The person may be seen going back over their recent movements and actions, trying to remember where they last had the object and how it could have been misplaced.", "Feeling frustrated or upset: The person may be seen displaying emotions such as frustration, anger, or sadness, as they struggle to locate the lost object."], "making": ["Cutting: The process of cutting materials such as paper, fabric, or plastic using a tool like scissors or a knife.", "Shaping: The process of molding or forming materials into a desired shape using tools like a hammer, mold, or press.", "Assembling: The process of putting together different parts or components to create a finished product.", "Painting: The process of applying a coating or color to a surface using a brush or other tool.", "Finishing: The process of giving a final touch or polish to a product, such as sanding, buffing, or polishing."], "milking": ["Holding the object: The person grips the object firmly to maintain control and stability while milking.", "Positioning the object: The person aligns the object's teat or nipple with the milking machine or hand to ensure efficient extraction of milk.", "Applying pressure: The person applies gentle pressure to the teat or nipple to express the milk. This may involve squeezing the object firmly but gently, or using a milking machine with adjustable pressure settings.", "Continuously milking: The person continues to apply pressure and move the object or machine along the teat or nipple to extract as much milk as possible.", "Cleaning and sanitizing: After milking, the person should clean and sanitize the object and any equipment used to prevent contamination and maintain hygiene."], "moving": ["Picking up the object: The person reaches out with their hand or arm and grasps the object.", "Lifting the object: The person uses their strength to lift the object off the ground or surface it was on.", "Carrying the object: The person moves the object while holding it in their hand or arms, using their body to support the weight.", "Placing the object: The person carefully sets the object down on a surface, such as a table or shelf.", "Releasing the object: The person lets go of the object, either by dropping it or by placing it down gently."], "not interacting": ["Walking: The person is moving from one place to another without any interaction with objects.", "Running: The person is moving quickly and with more force than walking.", "Sitting: The person is in a stationary position, not interacting with any objects.", "Lying down: The person is in a reclined position, not interacting with any objects.", "Standing still: The person is not moving and is in a stationary position."], "opening": ["Picking up the object: The person reaches out and grasps the object with their hand or hands.", "Holding the object: The person firmly grips the object with their hand or hands, ensuring a secure grasp.", "Lifting the object: The person uses their strength to lift the object off the surface it was sitting on.", "Rotating the object: The person may need to rotate the object to view the label or read the instructions.", "Opening the object: The person may need to use a tool or their hands to open the object, such as a package or a clasp."], "operating": ["Hand grasping the object", "Arm lifting the object", "Shoulder rotating the object", "Torso twisting the object", "Legs providing stability and support."], "packing": ["Picking up the object: The person reaches out and grabs the object with their hands.", "Holding the object: The person holds the object in their hands, either to examine it or to decide where to place it.", "Placing the object in a container or bag: The person carefully places the object into a container or bag, ensuring that it is secure and well-organized.", "Closing the container or bag: The person closes the container or bag, making sure that the object is secure and protected.", "Carrying the container or bag: The person carries the container or bag, either to a specific location or to a designated packing area."], "painting": ["Brush stroke: The act of using a brush to apply paint to the canvas or surface.", "Color selection: Choosing the colors to be used in the painting.", "Composition: Arranging the elements in the painting, such as the subject, background, and any other elements.", "Technique: The methods used to apply the paint, such as impasto, glazing, or sponging.", "Finishing touches: Adding final details and adjustments to the painting to complete it."], "parking": ["Opening the car door and stepping out of the vehicle.", "Walking towards the object to be parked, such as a parking meter or a designated parking spot.", "Positioning the vehicle in the desired parking spot or next to the parking meter.", "Closing the car door and walking away from the vehicle.", "Paying for the parking fee, if required, and placing the payment in the designated slot or handing it to the parking attendant."], "paying": ["Hand reaching out: The hand of the person reaching out to grab the object.", "Fingers curling around the object: The fingers of the person curling around the object to hold it.", "Money or payment method exchange: The person handing over money or a payment method to the seller or vendor.", "Object being handed over: The object being handed over from the person to the seller or vendor.", "Confirmation of transaction: The person and the seller or vendor confirming the transaction with a verbal or non-verbal exchange."], "peeling": ["Gripping the object: The person holds the object firmly with their hands, providing stability and control during the peeling process.", "Applying downward pressure: The person applies downward pressure on the object with their hands, creating a force that helps to loosen the peel and make it easier to remove.", "Sliding the peel: As the downward pressure is applied, the person slides their hands along the object, using the force to peel away the outer layer.", "Lifting the peel: Once the peel is loosened, the person lifts the peel away from the object, using their hands to guide it up and off.", "Discarding the peel: After the peel is removed, the person discards it, either by dropping it on the floor or placing it in a designated waste bin."], "petting": ["Hand placement: The hand of the person petting the object is typically placed on the surface of the object, with fingers curled under and the palm of the hand facing upwards.", "Finger movement: The person's fingers may move gently over the surface of the object, following a specific path or pattern.", "Pressure: The person may apply varying degrees of pressure to the object, from light and gentle to firm and assertive.", "Speed: The person's hand may move slowly and deliberately over the object, or quickly and with purpose.", "Eye contact: The person may maintain eye contact with the object while petting it, indicating their focus and attention."], "picking": ["Reaching: The person extends their arm and hand towards the object.", "Grasping: The person uses their hand to hold onto the object.", "Pulling: The person uses force to draw the object towards them.", "Lifting: The person uses their arm and hand to lift the object off the ground.", "Rotating: The person uses their arm and hand to turn the object in a circular motion."], "picking up": ["Grasping: The person reaches out with their hand(s) and places their fingers around the object.", "Lifting: The person uses their arm strength to lift the object off the ground or surface.", "Holding: The person positions the object in their hand(s) and maintains a firm grip.", "Rotating: The person may need to rotate the object to change its orientation or position it for a specific task.", "Carrying: The person moves the object from one location to another, either by holding it in their hand(s) or by using additional support, such as a tray or a bag."], "pointing": ["Hand gesture: The person is using their hand to point at the object, which is a common way to draw attention to something.", "Finger movement: The person is using their fingers to indicate the direction or location of the object, which is often used when pointing at something that is farther away or not directly in front of them.", "Eye contact: The person is looking at the object and directing their gaze towards it, which can be a subtle way of pointing without physically touching the object.", "Body language: The person may be using their body language, such as leaning forward or taking a step towards the object, to emphasize their point and draw attention to it.", "Verbal cues: The person may be using verbal cues, such as saying \"look at this\" or \"see over here,\" to indicate the object they are pointing at."], "pouring": ["Grasping the object: The person holds the object in their hand or hands.", "Lifting the object: The person uses their hands to lift the object off the surface it was sitting on.", "Pouring the object: The person tilts the object and pours its contents into a container or onto a surface.", "Stabilizing the object: The person uses their hands to stabilize the object as it pours, to prevent it from tipping over or spilling.", "Releasing the object: The person releases the object after it has finished pouring, allowing it to drop back onto the surface it was sitting on."], "pulling": ["Hand grasping the object: The person's hand can be seen holding onto the object, indicating that they are pulling it.", "Arm extending: The person's arm can be seen extending outward, indicating that they are exerting force to pull the object.", "Body posture: The person's body posture may change as they bend their knees and lean forward to apply more force to the object.", "Tension in the object: The object being pulled may show signs of tension or strain, indicating that the person is applying a significant amount of force.", "Movement of the object: The object being pulled may start to move, indicating that the person is successfully pulling it."], "pushing": ["Hand placement: The person's hands can be seen gripping the object and applying force to push it.", "Arm movement: The person's arm can be seen extending and bending as they push the object.", "Body posture: The person's body may lean forward or to the side as they push the object, with their weight transferred to the front foot.", "Leg movement: The person's legs may move slightly as they push the object, with the front foot pushing against the ground and the back foot lifting off the ground.", "Object movement: The object being pushed will move in the direction the person is facing, as a result of the force applied by the person's hands, arms, and body."], "racing": ["Running: The person is actively moving their legs and using their body to propel themselves forward.", "Focusing: The person is concentrating on the object they are racing and the path they need to take to reach it as quickly as possible.", "Strategizing: The person may be planning their route, deciding on the best approach to take, and anticipating any obstacles or changes in the course.", "Balancing: The person may need to maintain their balance while running at high speeds, especially if the course is uneven or has obstacles.", "Sprinting: The person may need to sprint at the end of the race to gain an advantage over their competitors and reach the object as quickly as possible."], "reading": ["Picking up the object: The person reaches out and grasps the object with their hands.", "Holding the object: The person supports the object with their hands, maintaining a firm grip.", "Examining the object: The person closely inspects the object, possibly rotating or turning it over to view different sides.", "Handling the object: The person manipulates the object, for example, by opening it, closing it, or moving it from one location to another.", "Putting the object down: The person releases the object and places it back on a surface or in its original location."], "releasing": ["Hand grasping the object: The person's hand can be seen holding the object, indicating that they are about to release it.", "Arm extending: The person's arm can be seen extending, suggesting that they are in the process of releasing the object.", "Finger positioning: The person's fingers can be seen positioning themselves to let go of the object, indicating that the release is about to occur.", "Eye contact: The person may be looking in the direction they are releasing the object, ensuring that it goes where they want it to.", "Body posture: The person's body posture may change as they prepare to release the object, with their weight shifting forward and their body positioning itself for the release."], "repairing": ["Inspecting the object: The person examines the object to identify the issue and determine the necessary repairs.", "Gathering tools and materials: The person collects the tools and materials needed for the repair, such as screwdrivers, wrenches, and replacement parts.", "Disassembling the object: The person takes the object apart to access the internal components and perform the necessary repairs.", "Performing the repairs: The person fixes the issue by replacing or repairing the damaged parts, using the tools and materials gathered in step 2.", "Reassembling the object: The person puts the object back together, making sure all the parts are securely fastened and functioning properly."], "riding": ["Sitting down on the object.", "Holding onto the object for support.", "Using the object for balance.", "Looking in the direction of travel.", "Adjusting the position of the object to maintain stability."], "rowing": ["Pulling the oar: The most obvious action involved in rowing is pulling the oar through the water. This motion requires strength and coordination to maintain a steady rhythm and propel the boat forward.", "Sitting in the seat: A person rowing an object must sit in the seat of the boat and maintain a proper posture to ensure stability and control.", "Using the legs: Rowers often use their legs to push off the ground and generate power for the stroke. This motion helps to propel the boat forward and can be an important part of the rowing technique.", "Stabilizing the boat: While rowing, a person must also work to stabilize the boat by keeping it upright and balanced. This requires constant adjustments and coordination to maintain a smooth and steady rowing motion.", "Catching the oar: At the end of each stroke, the rower must catch the oar and prepare for the next stroke. This action requires good hand-eye coordination and timing to ensure a smooth and efficient rowing motion."], "running": ["The person's arms are outstretched in front of them, with their hands gripping the object.", "The person's legs are moving quickly, propelling them forward as they run with the object.", "The person's body is leaning slightly forward, with their head down and eyes focused on the path ahead.", "The person's breathing is quick and shallow, as they exert themselves to run with the object.", "The person's muscles are tense and flexed, as they use their strength to move the object quickly and efficiently."], "sailing": ["Holding the object: The person is holding the object, which could be a sail or a rope, in their hands.", "Pointing: The person is pointing towards something, possibly indicating a direction or a specific location.", "Looking up: The person is looking up, possibly observing the sky or the surroundings for any changes in weather or wind conditions.", "Bending down: The person is bending down, possibly to pick up an object or to examine something on the ground.", "Walking: The person is walking, possibly moving towards a different location on the boat or the shore."], "scratching": ["The person's hand making contact with the object.", "The object being scratched.", "The person's fingers gripping the object.", "The person's hand moving across the object.", "The object being scratched leaving a mark or removing a layer of material."], "serving": ["Preparing to serve: The person reaches for the object, holding it in their hand or grasping it with both hands.", "Serving the object: The person swings their arm and releases the object, sending it towards the intended target.", "Following through: After releasing the object, the person's arm continues its motion, finishing in a follow-through position.", "Catching the object: If the object is hit back towards the server, they must quickly react and catch it with their hands or gloves.", "Returning the object: After catching the object, the person must quickly return it to the server, either by throwing or hitting it back towards them."], "setting": ["Picking up the object: The person reaches out with their hand and grasps the object.", "Holding the object: The person maintains a firm grip on the object with their hand.", "Lifting the object: The person uses their strength to lift the object off the surface it was on.", "Carrying the object: The person moves the object from one location to another while maintaining control of it.", "Placing the object: The person carefully sets the object down on a surface, ensuring it doesn't fall or slide off."], "shearing": ["Gripping the object: The person holds the object firmly in their hands to maintain control and stability during the shearing process.", "Positioning the object: The person positions the object at the desired angle and location for shearing, ensuring that the cutting path is clear and accurate.", "Applying pressure: The person applies pressure to the object using a shearing tool, such as a pair of scissors or a razor blade, to cut through the material.", "Cutting the object: The person uses the shearing tool to make a clean, precise cut along the desired path, creating a smooth and even edge.", "Removing the object: After the cutting is complete, the person carefully removes the object from the surface it was sheared from, ensuring that no remnants or debris are left behind."], "signing": ["Holding the object: The person holds the object in their hand or hands while signing.", "Positioning the hand: The person positions their hand or hands above the object, with the signing hand typically above the object.", "Making contact: The person makes contact with the object using their signing hand, either by touching the object directly or by using a tool such as a pen or stylus.", "Signing: The person signs the object using their hand or hands, using the appropriate signing movements and gestures to convey the intended meaning.", "Releasing the object: The person releases the object after signing it, either by dropping it or by placing it back on a surface."], "sipping": ["Raising the object to the mouth.", "Bringing the object to the mouth.", "Placing the object on the lips.", "Lowering the object back down after taking a sip.", "Holding the object steady while sipping."], "sitting at": ["Hand on object: The person's hand is placed on the object, indicating that they are interacting with it in some way.", "Eye contact: The person is looking at the object, which suggests that they are focused on it and possibly considering its purpose or function.", "Body posture: The person's body posture, such as sitting up straight or leaning forward, can indicate their level of interest and engagement with the object.", "Movement: The person may be moving their hand or body in some way, such as picking up the object, examining it, or manipulating it.", "Expression: The person's facial expression, such as a frown or a smile, can provide clues about their emotional response to the object and their level of interest in it."], "sitting on": ["Sitting down on the object.", "Crossing legs while sitting.", "Holding an object in hands while sitting.", "Looking down at the object in hands.", "Talking or communicating with someone while sitting."], "sliding": ["Hand grasping the object: The person holds the object in their hand, providing the necessary grip and control for sliding.", "Hand positioning: The person positions their hand correctly on the object, ensuring a smooth and controlled slide.", "Body movement: The person shifts their body weight and moves their body in the direction of the slide, generating momentum and speed.", "Foot placement: The person places their feet shoulder-width apart, providing stability and balance during the slide.", "Eye contact: The person maintains eye contact with the direction of the slide, focusing on the intended path and ensuring proper alignment."], "smelling": ["The person's head is tilted to the side, indicating that they are focusing on the object's scent.", "The person's nose is wrinkled, which is a common response when smelling something strong or unfamiliar.", "The person's mouth may be slightly open, as they breathe in the scent more deeply.", "The person's eyes may be closed, as they concentrate on the sensation of the scent.", "The person may be holding the object to their nose, or bringing it closer to their face, to enhance the smelling experience."], "spinning": ["Hand movement: The person's hand(s) will be seen making circular or rotational motions as they spin the object.", "Arm movement: The person's arm(s) will be seen moving in a circular or rotational motion as they spin the object.", "Body rotation: The person's body will be seen rotating as they spin the object.", "Finger movement: The person's fingers will be seen making precise movements as they grip and manipulate the object.", "Balance: The person will need to maintain their balance while spinning the object, which may involve shifting their weight or adjusting their stance."], "squeezing": ["Hand gripping the object: The hand of the person squeezing the object will be visible, with the fingers wrapped around the object and the thumb and index finger providing additional support.", "Finger and thumb pressure: The person's fingers and thumb will apply pressure to the object, with the thumb on the bottom and the fingers on top.", "Object deformation: The object being squeezed will show signs of deformation, such as wrinkles or creases, as the person applies pressure.", "Muscle movement: The person's muscles will contract as they squeeze the object, causing the hand and arm to move in a coordinated manner.", "Joint movement: The person's joints, including the wrist, elbow, and shoulder, will move in a coordinated manner as they apply pressure and squeeze the object."], "stabbing": ["The person holding the object with a stabbing motion.", "The person's hand and arm making a stabbing motion.", "The object being stabbed by the person.", "The person's face and body language indicating aggression and focus.", "Any accompanying sounds or noises made by the person or the object being stabbed."], "standing on": ["Balancing: The person is actively maintaining their balance on the object, which requires constant adjustments and concentration.", "Climbing: The person is using their hands and feet to ascend the object, which requires strength, agility, and coordination.", "Jumping: The person is using their legs to propel themselves off the ground and onto the object, which requires power and timing.", "Dismounting: The person is getting off the object, which requires lower body strength and coordination to maintain stability.", "Performing a trick or stunt: The person is using the object as a platform to perform a specific maneuver, which requires skill, practice, and control."], "standing under": ["Crouching or bending the knees to lower the body height.", "Holding onto the object for support or balance.", "Looking up at the object or the sky above.", "Reaching up to touch the object or to grab something hanging from it.", "Standing still and observing the object or the surroundings."], "sticking": ["Grasping the object: The person reaches out with their hand and places it around the object.", "Holding the object: The person maintains a firm grip on the object with their hand.", "Pulling the object: The person applies force to the object, causing it to move away from its original position.", "Lifting the object: The person raises the object off the ground or a surface by exerting upward force.", "Throwing the object: The person releases the object with force, causing it to travel through the air."], "stirring": ["Raising the object above the surface: The person lifts the object above the surface, creating a clear visual indication of their action.", "Rotating the object: As the person stirs, they may rotate the object in a circular motion, which can be seen and identified.", "Striking the object: The person may strike the object with a spoon or other utensil, creating a distinct sound and visual cue.", "Tipping the object: The person may tilt the object on its side, creating a visible change in its orientation.", "Mixing the contents: As the person stirs, they may mix the contents of the object, creating a visible blending of the ingredients."], "stopping at": ["The person's body position changes, with their feet stopping or slowing down, and their upper body continuing to move forward.", "The person's eyes focus on the object, indicating their attention is drawn to it.", "The person's hand may reach out or extend towards the object, either to touch it or to prepare to do so.", "The person's mouth may open or their breathing may change as they process the situation and consider their next move.", "The person's posture may change, with their weight shifting from their forward momentum to their newly stopped position."], "straddling": ["Bending: The person may bend their knees and lower their body to get closer to the object.", "Leaning: The person may lean forward or backward to get a better view or reach of the object.", "Grasping: The person may reach out and grab the object with their hands.", "Pulling: The person may use their strength to pull the object towards them.", "Lifting: The person may lift the object off the ground or a surface by using their arms and upper body strength."], "swinging": ["The person gripping the object with both hands.", "The person raising the object above their head.", "The person swinging the object forward and downward.", "The person following through with the swing.", "The person releasing the object after the swing."], "tagging": ["Picking up the object: The person reaches out and grasps the object with their hand or another tool.", "Holding the object: The person maintains a firm grip on the object while it is being tagged.", "Positioning the tagging device: The person aligns the tagging device (such as a sticker or a label) with the object and prepares to apply it.", "Applying the tag: The person presses down on the tagging device to adhere it to the object, making sure it is securely attached.", "Removing the tagging device: The person carefully removes the tagging device from the object, ensuring that it is not damaged or left behind."], "talking on": ["Hand holding the object to the ear.", "The person's mouth moving in a speaking motion.", "The person's eyes looking up and to the side, as if listening intently.", "The person's body posture, such as leaning forward or sitting up straight, indicating their focus on the conversation.", "The person's facial expression, which may show emotions such as happiness, surprise, or concern, depending on the content of the conversation."], "teaching": ["Demonstrating the proper technique or method for using the object.", "Providing step-by-step instructions or guidance.", "Offering hands-on assistance or supervision.", "Encouraging and motivating the learner through verbal or non-verbal cues.", "Providing feedback and correction as needed to ensure the learner is understanding and mastering the object."], "texting on": ["Holding the object in one hand and using the other hand to type on the screen.", "Using a stylus to write or draw on the object's surface.", "Using a specialized app that allows the object to function as a virtual keyboard or touchpad.", "Using the object as a makeshift stand for the phone or tablet to improve viewing angles.", "Using the object to prop up the phone or tablet to create a more comfortable typing position."], "throwing": ["The person's arm is raised and extended, with the object gripped firmly in their hand.", "The person's body is rotating and pivoting on their feet, transferring their weight from the back foot to the front foot as they prepare to throw the object.", "The person's eyes are focused on the target, and their head is angled towards it, as they line up the throw.", "The person's mouth is open, and they may be making a sound, such as a grunt or a shout, to help them concentrate and generate power for the throw.", "The person's arm is fully extended, and the object is released with a snap of the wrist, sending it flying towards the target."], "tying": ["Bending the knees: As the person bends their knees, they lower their center of gravity, making it easier to tie the object securely.", "Crossing the legs: The person may cross their legs while tying the object, which can help with balance and stability.", "Holding the object: The person holds the object in one or both hands while tying it, ensuring that it remains steady and does not move around.", "Bringing the ends together: The person brings the ends of the object together, creating a loop that can be tied.", "Tying the knot: The person ties a knot in the loop to secure the object in place. This may involve using a specific technique, such as a slip knot or a bow knot, depending on the type of object being tied."], "toasting": ["Raising the object above the head.", "Holding the object in both hands.", "Bringing the object close to the face.", "Tilting the head back.", "Making a \"cheers\" gesture with the object."], "training": ["Holding the object: The person is holding the object in their hands, which is a crucial step in training the object.", "Observing the object: The person is closely observing the object, analyzing its features and characteristics to understand how it works and what it can be trained to do.", "Gripping the object: The person is gripping the object firmly but not too tightly, which is important for maintaining control and preventing damage to the object during training.", "Moving the object: The person is moving the object in a controlled and deliberate manner, which is necessary for teaching the object new behaviors and commands.", "Reinforcing the object: The person is reinforcing the object by providing positive feedback or rewards, which helps to strengthen the bond between the person and the object and encourages the object to learn and perform new tasks."], "turning": ["Gripping: The person holds the object with their hands, using a firm yet comfortable grip.", "Rotating: The person uses their hands, arms, or body to rotate the object in a circular motion.", "Twisting: The person applies pressure to the object and twists it in a spiral motion.", "Pivoting: The person places one end of the object on a surface and uses their body weight to pivot it in a controlled manner.", "Lifting: The person lifts the object off the ground or a surface and rotates it in the air before placing it back down."], "typing on": ["Hand placement: The person's hands are likely positioned on the object, such as a keyboard or touchpad, to type.", "Finger movement: The person's fingers are moving across the keys or touchpad to type letters and symbols.", "Wrist movement: The person's wrist may be moving in a circular motion as they type, to help with the fluidity of their movements.", "Eye movement: The person's eyes may be moving up and down as they read and type, to help with the process of reading and typing.", "Head movement: The person's head may be moving slightly as they type, to help with the process of reading and typing."], "walking": ["Picking up the object: The person reaches out with one or both hands and grasps the object.", "Holding the object: The person maintains a firm grip on the object while it is being carried.", "Lifting the object: The person bends their knees and lifts the object off the ground, using their strength and balance to support it.", "Carrying the object: The person walks while holding the object, maintaining a steady gait and keeping the object close to their body.", "Placing the object down: The person reaches their destination and carefully sets the object down on a flat, stable surface."], "washing": ["Holding the object: The person holds the object above the water in a basin or sink.", "Immersing the object: The person submerges the object in the water, ensuring that it is completely covered.", "Rinsing the object: The person uses water to clean the object, removing any dirt or debris.", "Drying the object: The person uses a towel or a hairdryer to dry the object, making sure that it is completely dry before use.", "Storing the object: The person places the object in a safe and dry location, away from water and moisture, to prevent damage or deterioration."], "watching": ["Observing: The person is actively looking at the object, focusing their attention on it.", "Tracking: The person is following the object's movement, either in a static or dynamic environment.", "Scanning: The person is quickly surveying the area to locate the object or to assess the situation.", "Mapping: The person is mentally creating a visual representation of the environment, including the location of the object.", "Recognizing: The person is identifying the object based on its features, shape, or color, and associating it with a particular category or object type."], "waving": ["Raising arm: The person lifts their arm up to waive the object.", "Extending arm: The person extends their arm outward to reach the object and make contact with it.", "Holding object: The person holds the object in their hand while waving it.", "Moving arm: The person moves their arm back and forth to create a waving motion.", "Waving motion: The person's arm moves in a waving motion, typically in a circular or back-and-forth pattern."], "wearing": ["Wearing a necklace around the neck.", "Holding a cell phone in the hand.", "Wearing a wristwatch on the wrist.", "Putting on a pair of glasses.", "Wearing a ring on the finger."], "wielding": ["Grip: The way a person holds the object, which can provide insight into their level of control and comfort with the item.", "Stance: The position of the body and the distribution of weight while holding the object, which can affect the power and accuracy of the swing.", "Swing: The motion of the object being wielded, which can include the speed, direction, and force applied to the object.", "Follow-through: The continuation of the swing after making contact with the target, which can affect the accuracy and consistency of the hit.", "Reaction: The immediate response to the outcome of the swing, which can include the expression of surprise, satisfaction, or disappointment."], "zipping": ["The person holding the object in their hand.", "The person pulling the zipper up.", "The zipper being pulled up.", "The object being zipped.", "The person's hand on the zipper."]}